---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.SymbolicLine
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.SymbolicLine

Creates lines that are meant for symbolic purposes only, and are not part of the actual geometry of the component or building model.